[{"1": "Boy: I'll pay you 10 bucks to climb up the flagpole.Girl: ok.(climbs the flagpole)Girl: Mommy Mommy a boy paid me 10 bucks to climb the flagpole. Mom: He just wanted to see your underwear!...Next Day...(Same boy): I'll pay you 20 BUCKS to climb the flagpole!Girl: OK thanks! (climbs the flagpole)Girl: Mommy Mommy today the boy paid me 20 BUCKS for climbing the flagpole, but today I tricked him this time I wasn't wearing underwear.Mom:..."}, {"2": "A man and a woman meet in an elevator. \"Where are you heading today?\" the man asks.\"I'm going down to give blood.\"\"How much do you get paid for giving blood?\"\"About $20.\"\"Wow,\" says the man, \"I'm going up to donate sperm, and the sperm bank pays $100.\" The woman angrily gets off the elevator.The next day, the man and woman meet in the elevator again.\"Fancy meeting you again. Where you off to today?\"\"Sperm bank,\" she says with her mouth full."}, {"3": "Hello guys this is a gay testIf you rate this kickass ur not gay, vice versa.I wanna c how many ppl r gay"}, {"4": "A guy walks into a bar with an alligator. It's about 10 feet long. The bartender flips out and says, \"Hey buddy, you gotta get that son of a b*tch outta here. It's going to bite one of my customers and I'm going to get sued.\"The guy says, \"No no no, it's a tame alligator. I'll prove it to you.\"He picks up the alligator and puts it on the bar. Then he unzips his pants, pulls out his package and sticks it in the alligator's mouth. The alligator just keeps his mouth open. After about 5 minutes, he pulls it out of the alligator's mouth and zips up his pants and says, \"See, I told you it was a tame alligator. Anybody else want to try it?\"The drunk down at the end of the bar says, \"Yah, I'd like to try it but I don't think I can hold my mouth open that long!\""}, {"5": "A dick has a sad life. His hair is a mess; his family is nuts; his next-door neighbor is an asshole; his best friend is a pussy, and his owner beats him habitually."}, {"6": "A husband and wife are trying to set up a new password for their computer. The husband puts, \"Mypenis,\" and the wife falls on the ground laughing because on the screen it says, \"Error. Not long enough.\""}, {"7": "girl - baby im wet.Boy - want a paper towel?Girl - no, i want more then that ;)Boy - want 2 paper towels? Girl - no, baby i want sumthing big and round ;) Boy - damn you want the whole roll?"}, {"8": "Roses are redNuts are brownSkirts go upPants go downBody to body Skin to skinWhen its stiffStick it inThe Longer its inThe Stronger it getsIt goes in dry And comes out wetIt comes out dripping And starts to sagIts not what you think......Its a Teabag"}, {"9": "My girl caught me blowing my dick with the air dryer, and asked what I was doing? Apparently \"heating your dinner\" wasn't a good answer."}, {"10": "My girlfriend came out of the shower and said, \"I shaved my pussy you know what that means?\"I said, \"Yeah the fucking drain is clogged again.\""}, {"11": "My boy friend said if this gets 200 kick-ass votes... were gonna try anal. please don't vote. he's on Viagra. "}, {"12": "Friend: Dude, I can't stop dreaming about my crush.Me: Well imagine this... You're home alone, and your crush comes over to visit.Friend: Ok I can see it...Me: She walks into your room and you're just sitting there. Friend: Uh-huh.. I'm likin' this. Me: Ok. So she walks in front of you, takes her pants off. She's not wearing any underwear.. And then she sits on you. Friend: Oh-ho-hoo.. Whatta' naughty girl. Me: Yeah, ok. Don't get dirty on me. So she's sitting on you. And then... she starting shitting in you. Right then and there, you find out you're a toilet. Friend: I hate you..."}, {"13": "A kid walks into a class with a shirt, pants, underwear, and socks the teacher asks, \"Where have you been?\" The boy says, \"On top of blueberry hill.\" Then another boy walks in with no shirt and no socks and the teacher says, \"Where have you been?\" The boy says, \"On top of blueberry hill.\" Then a girl walks in and the teacher asks, \"Where have you been? Oh, let me guess on top of blueberry hill.\" and the girl says, \"No, I am blueberry hill.\""}, {"14": "Me: Say \"I am a man\" after everything I say.Friend: Alright.Me: You broke up with your girlfriend.Friend: I am a man.Me: You decided to get drunk.Friend: I am a man.Me: You went to the bar.Friend: I am a man.Me: You found a hot chick there.Friend: I am a man.Me: You invited her to your house and she said yes.Friend: I am a man.Me: You both came into your room and had sex.Friend: I am a man.Me: Next morning you wake up.Friend: I am a man.Me: And she says...Friend: I am a man."}, {"15": "One day, Little Johnny saw his grandpa smoking his cigarettes. Little Johnny asked, \"Grandpa, can I smoke some of your cigarettes?\" His grandpa replied, \"Can your penis reach your asshole?\" \"No\", said Little Johnny. His grandpa replied, \"Then you're not old enough.\" The next day, Little Johnny saw his grandpa drinking beer. He asked, \"Grandpa, can I drink some of your beer?\" His grandpa replied, \"Can your penis reach your asshole?\" \"No\" said Little Johhny. \"Then you're not old enough.\" his grandpa replied. The next day, Little Johnny was eating cookies. His grandpa asked, \"Can I have some of your cookies?\" Little Johnny replied, \"Can your penis reach your asshole?\" His grandpa replied, \"It most certainly can!\" Little Johnny replied, \"Then go fuck yourself. These are my cookies!\""}, {"16": "My girlfriend said if this gets 100 votes we'll try anal.So please don't vote, her strap on is huge and it really scares me."}, {"17": "Little Girl: Mom what's this *she pulled down her pants*Mom: That's your garage, don't let boys put their car into your garage She nods and hops offNext doorLittle Boy: Dad whats this? *he pulls down his pants* Dad: That's your car, you need to put that into a girls garage He nods and hops off Little girl walks in with her hands covered with bloodMom: WHAT HAPPENED!? Little Girl: The little boy from next door tried to put his car into my garage so I pulled its wheels off "}, {"18": "Guy: Wanna suck my dick?Girl: No.Guy: Probably for the best. I mean, it has a label-Warning! Choking Hazard!Girl: Isn't that the warning put on tiny objects?"}, {"19": "Son: Dad do you remember your first blowjob?Dad: Ohhh yeah I do! Son: How did it taste?Dad: Get out."}, {"20": "Charlie was visiting an old friend and his wife for dinner. When the time came to leave, his car wouldn't start, and it was too late to call the local service station.The husband urged Charlie to stay over. There was no spare bed in the house; there wasn't even a sofa. So Charlie would have to sleep with the husband and wife. No sooner had the husband fallen asleep when the wife taped Charlie on the shoulder and motioned for him to come over to her. \"I couldn't do that,\" he whispered. \"Your husband is my best friend!\" \"Listen, sugar,\" she whispered back, \"there ain't nothing in the whole wide world could wake hime up now.\" \"I can't believe that,\" Charlie said. \"Certainly if I get on top of you and screw you, he'll wake up won't he? \"Sugar, he certainly won't. If you don't believe me, pluck a hair out of his asshole and see if that wakes him.\" Charlie did just that. He was amazed when the husband remained asleep. So he climbed over to the wife's side of the bed and fucked her. When he finished, he climbed back to his own side. It wasn't long before she tapped him on the shoulder and beckoned him over again. Again he pulled a hair to determine if his old friend was asleep. This went on eight times during the night. Each time Charlie screwed the woman, he first pulled out one of the husband's asshole hairs. The ninth time he pulled a hair, the husband awoke and muttered: \"Listen, Charlie, old pal, I don't mind you fucking my wife, but for Pete's sake, stop using my ass for a scoreboard!\""}, {"21": "PLEASE KICKASS if you want China to stop eating dogs.if you click lame you're cruel."}, {"22": "Teacher: And therefore, sperm cells are made up of glucose.Student: So you're saying that sperm has sugar in it?Teacher: Technically. Yes.Student: But it doesn't even taste like that...Teacher: what?Student: what?"}, {"23": "Me:Santa do you have 3 daughters?Santa: Yes I do. Me:I guess there names are holly, jolly, frolly?Santa: No there names are ho ho ho ;)Kickass if you get it"}, {"24": "1.A mother and father took their 6-year-old son to a nude beach. As the boy walked along the beach, he noticed that some of the ladies had boobs bigger than his motherâ\u0080\u0099s, and asked her why. She told her son, \"The bigger they are the dumber the person is.\" The boy pleased with the answer, goes to play in the ocean but returns to tell his mother that many of the men have larger \"units\" than his dad. His mother replied, \"The bigger they are the dumber the person is.\" Again satisfied with this answer, the boy returns to the ocean to play. Shortly after, the boy returned again. He promptly told his mother, \"Daddy is talking to the dumbest girl on the beach, and the longer he talks, the dumber he gets.\" "}, {"25": "Don't ever let your girl talk to another guy about her problems; a shoulder to cry on, becomes a dick to ride on.#Based on a true story"}, {"26": "How fast can you guess these words?1._ _ _ k2._ _ndom3.d_ckAnswers:1. book2. random3.duckYou didn't get them right you dirty minded slut!"}, {"27": "Who's the biggest prostitute in history? Ms. Pacman, for 25 cents that b*tch swallowed balls till she died."}, {"28": "FIRETRUCK GAMEBoy: Let's play the firetruck game.Girl: How do you play?Boy: I run my fingers up your leg, and you say \"redlight\" when you want me to stop. Girl: Okay :)*Few seconds later*Girl: REDLIGHT!!Boy: Firetrucks don't stop for redlights ;)"}, {"29": "Guy: Can I buy you a drink?Girl: Sorry, but alcohol is bad for my legs.Guy: Do they swell?Girl: No. They spread."}, {"30": "(Dad's daughter walks up to him)Daughter- Dad i gotta tell u something...Dad- Whats tht?Daughter- I'm a lesbian.Dad- Okay.(Dad walks around then his other daughter comes up to him)Daughter #2- Dad i gotta tell u something...Dad- Whts tht?Daughter #2- I'm a lesbian.Dad- Damn, does anybody in this house like dick?Son- I do!!!!"}]